lurney/m5stack-tab5-nc1020-ST7121/sdkconfig.defaults
# ── Target ──
CONFIG_IDF_TARGET="esp32p4"

# ── PSRAM ──
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# ── L2 cache: keep at 128KB but widen the line to 128B for better prefetch of
#    the emulator's sequential opcode fetches from PSRAM. (512KB cache doesn't
#    fit — it's carved from the same on-chip SRAM the 6502 RAM/BSS needs.)
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# ── MIPI DSI ──
CONFIG_SOC_MIPI_DSI_SUPPORTED=y

# ── Flash ──
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ── Partition table ──
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="/home/lurney/桌面/m5stack-tab5-nc1020/partitions_ota.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ── FreeRTOS ──
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=65536

# ── USB Host ──
CONFIG_USB_HOST_HUBS_SUPPORTED=y
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y

# ── FAT filesystem ──
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_CODEPAGE_936=y
CONFIG_FATFS_API_ENCODING_UTF_8=y

# ── Audio codec (esp_codec_dev) ──
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n

# ── Optimizations — performance ──
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_HAL_ASSERTION_DISABLE=y
CONFIG_COMPILER_SAVE_RESTORE_LIBCALLS=y
CONFIG_ESP_ERR_TO_NAME_LOOKUP=n

# ── I2C ──
CONFIG_I2C_ISR_IRAM_SAFE=n

# ── Disable watchdog on CPU0 (USB HID Host starves IDLE task) ──
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
